In [1]:
import numpy as np
import pandas as pd

 The basic syntax for creating a pandas Series:
 my_series = pd.Series(data,index)

#### Creating Series from Python List

In [2]:
countries = ['USA','Nigeria','France','Ghana']
my_data=[100,200,300,400]

In [3]:
pd.Series(countries,my_data)

100        USA
200    Nigeria
300     France
400      Ghana
dtype: object

#### Creating Series from a numpy array

In [4]:
np_arr = np.array(my_data)

In [5]:
pd.Series(np_arr)

0    100
1    200
2    300
3    400
dtype: int64

#### Creating Series from Python Dictionary

In [6]:
my_dict ={'a':40,'b':88,'c':90,'d':100}

In [7]:
pd.Series(my_dict)

a     40
b     88
c     90
d    100
dtype: int64

What differentiates a Pandas Series from a Numpy array is that pandas series can hold a variety of object types.

#### Grabbing information from a Series.

In [8]:
series1 = pd.Series([1,2,3,4],['London','HongKong','Lagos','Nairobi'])

In [9]:
series1['London']

1

In [10]:
series2= pd.Series([1,4,6,9],['Accra','London','Washington Dc','CapeTown'])

In [11]:
series1 + series2

Accra            NaN
CapeTown         NaN
HongKong         NaN
Lagos            NaN
London           5.0
Nairobi          NaN
Washington Dc    NaN
dtype: float64

In [12]:
series1 - series2

Accra            NaN
CapeTown         NaN
HongKong         NaN
Lagos            NaN
London          -3.0
Nairobi          NaN
Washington Dc    NaN
dtype: float64

### DataFrame

The basic syntax of creating a DataFrame:

  pd.Dataframe(data,index)

In [13]:
df = pd.DataFrame (np.random.randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [14]:
df

          W         X         Y         Z
A -1.164788 -1.628799  0.500422 -1.095089
B -0.487427 -0.681126  0.162721 -1.457960
C  0.063555  1.288320  1.058687  0.100527
D  1.110595  0.499185 -0.565772  0.775290
E  0.874250 -1.020855 -0.190826 -0.821112

### Creating a Dataframe from a dictionary of series

In [15]:
df ={"Name":pd.Series(['John','Richie','Delilah'],index=['a','b','c']),
    'Age':pd.Series(['32','34','89','88'],index=['a','b','c','d']),
    'Nationality':pd.Series(['US','China','US'],['a','b','c'])
    }

In [16]:
pd.DataFrame(df)

      Name Age Nationality
a     John  32          US
b   Richie  34       China
c  Delilah  89          US
d      NaN  88         NaN

#### Creating Dataframe from a dictionary list

In [17]:
data = {'name':['George','Ann','Timo','Charles','Phil'],
         'age': [40,24,33,21,20],
          'year':[2000,2001,2010,2011,2003]
        }

In [18]:
my_df = pd.DataFrame(data,index=['Lagos','Dubai','Accra','Cape','SA'])

In [19]:
my_df

          name  age  year
Lagos   George   40  2000
Dubai      Ann   24  2001
Accra     Timo   33  2010
Cape   Charles   21  2011
SA        Phil   20  2003

### Selecting columns from dataframes

In [20]:
my_df['name']

Lagos     George
Dubai        Ann
Accra       Timo
Cape     Charles
SA          Phil
Name: name, dtype: object

In [21]:
type(my_df['name'])

pandas.core.series.Series

In [22]:
my_df[['name','year']]

          name  year
Lagos   George  2000
Dubai      Ann  2001
Accra     Timo  2010
Cape   Charles  2011
SA        Phil  2003

In [23]:
df['Year']=pd.Series(['2016','2017','2018','2019'],['a','b','c','d'])

In [24]:
pd.DataFrame (df)

      Name Age Nationality  Year
a     John  32          US  2016
b   Richie  34       China  2017
c  Delilah  89          US  2018
d      NaN  88         NaN  2019

### Creating a new column from other columns

In [25]:
df['Birth_Year']=df['Year']+df['Age']

In [26]:
pd.DataFrame (df)

      Name Age Nationality  Year Birth_Year
a     John  32          US  2016     201632
b   Richie  34       China  2017     201734
c  Delilah  89          US  2018     201889
d      NaN  88         NaN  2019     201988

In [27]:
print(df)

{'Name': a       John
b     Richie
c    Delilah
dtype: object, 'Age': a    32
b    34
c    89
d    88
dtype: object, 'Nationality': a       US
b    China
c       US
dtype: object, 'Year': a    2016
b    2017
c    2018
d    2019
dtype: object, 'Birth_Year': a    201632
b    201734
c    201889
d    201988
dtype: object}